apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_flexcan.c
  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      putreg32(0, priv->base + S32K1XX_CAN_RXIMR_OFFSET(i));
    }

  /* Filtering catchall */

  putreg32(0x3fffffff, priv->base + S32K1XX_CAN_RX14MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + S32K1XX_CAN_RX15MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + S32K1XX_CAN_RXMGMASK_OFFSET);
  putreg32(0x0, priv->base + S32K1XX_CAN_RXFGMASK_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: s32k1xx_caninitialize
 *
 * Description:
 *   Initialize the CAN controller and driver
 *
 * Input Parameters:
 *   intf - In the case where there are multiple CAN devices, this value
 *          identifies which CAN device is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int s32k1xx_caninitialize(int intf)
{
  struct s32k1xx_driver_s *priv;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_S32K1XX_FLEXCAN0
    case 0:
      priv               = &g_flexcan0;
      memset(priv, 0, sizeof(struct s32k1xx_driver_s));
      priv->base         = S32K1XX_FLEXCAN0_BASE;
      priv->config       = &s32k1xx_flexcan0_config;

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN0_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN0_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K1XX_FLEXCAN1
    case 1:
      priv         = &g_flexcan1;
      memset(priv, 0, sizeof(struct s32k1xx_driver_s));
      priv->base   = S32K1XX_FLEXCAN1_BASE;
      priv->config = &s32k1xx_flexcan1_config;

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN1_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN1_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN1_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN1_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K1XX_FLEXCAN2
    case 2:
      priv         = &g_flexcan2;
      memset(priv, 0, sizeof(struct s32k1xx_driver_s));
      priv->base   = S32K1XX_FLEXCAN2_BASE;
      priv->config = &s32k1xx_flexcan2_config;

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN2_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN2_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_SAMPLEP;
#  endif
      break;
#endif

    default:
      return -ENODEV;
    }

  if (!s32k1xx_bitratetotimeseg(&priv->arbi_timing, 1, 0))
    {
      nerr("ERROR: Invalid CAN timings please try another sample point "
           "or refer to the reference manual\n");
      return -1;
    }

#ifdef CONFIG_NET_CAN_CANFD
  if (!s32k1xx_bitratetotimeseg(&priv->data_timing, 1, 1))
    {
      nerr("ERROR: Invalid CAN data phase timings please try another "
           "sample point or refer to the reference manual\n");
      return -1;
    }
#endif

  s32k1xx_pinconfig(priv->config->tx_pin);
  s32k1xx_pinconfig(priv->config->rx_pin);
  if (priv->config->enable_pin > 0)
    {
      s32k1xx_pinconfig(priv->config->enable_pin);
      s32k1xx_gpiowrite(priv->config->enable_pin, priv->config->enable_high);
    }

  /* Attach the flexcan interrupt handler */

  if (irq_attach(priv->config->bus_irq, s32k1xx_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN bus IRQ\n");
      return -EAGAIN;
    }

  if (irq_attach(priv->config->error_irq, s32k1xx_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN error IRQ\n");
      return -EAGAIN;
    }

  if (priv->config->lprx_irq > 0)
    {
      if (irq_attach(priv->config->lprx_irq,
                     s32k1xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN LPRX IRQ\n");
          return -EAGAIN;
        }
    }

  if (irq_attach(priv->config->mb_irq, s32k1xx_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN OR'ed Message buffer (0-15) IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  priv->dev.d_ifup    = s32k1xx_ifup;      /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = s32k1xx_ifdown;    /* I/F down callback */
  priv->dev.d_txavail = s32k1xx_txavail;   /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = s32k1xx_ioctl;     /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = priv;              /* Used to recover private state from dev */
  priv->rx            = (struct mb_s *)(priv->base + S32K1XX_CAN_MB_OFFSET);
  priv->tx            = (struct mb_s *)(priv->base + S32K1XX_CAN_MB_OFFSET +
                          (sizeof(struct mb_s) * RXMBCOUNT));

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling s32k1xx_ifdown().
   */

  ninfo("callbacks done\n");

  s32k1xx_initialize(priv);

  s32k1xx_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the enabled CAN device interfaces.  If there are more
 *   different network devices in the chip, then board-specific logic will
 *   have to provide this function to determine which, if any, network
 *   devices should be initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_S32K1XX_FLEXCAN0
  s32k1xx_caninitialize(0);
#endif

#ifdef CONFIG_S32K1XX_FLEXCAN1
  s32k1xx_caninitialize(1);
#endif

#ifdef CONFIG_S32K1XX_FLEXCAN2
  s32k1xx_caninitialize(2);
#endif
}
#endif

#endif /* CONFIG_S32K1XX_FLEXCAN */
